'''Задача 1
Вывести на экран числа от 1 до 5. Результат:

1 2 3 4 5
'''
for i in range(1,6):
    print(i, end=' ')
