# Вывести на экран таблицу умножения на 3.
for i in range(1,10):
    print(i,'* 3 =',i*3)
