'''Определить четверть координатной плоскости по координатам x и y.
Применить минимум два разных подхода в указании условий.
'''
x = float(input('Координата X:'))
y = float(input('Координата Y:'))
if x > 0:
    if y > 0:
        print('Первая четверть')
    elif y < 0:
        print('Вторая четверть')
    else:
        print('Точка на оси Y')
elif x < 0:
    if y > 0:
        print('Четвертая четверть')
    elif y < 0:
        print('Третья четверть')
    else:
        print('Точка на оси Y')
elif x==y==0:
    print('Точка в начале координат')
else:
    print('Точка на оси X')
    
